Revit 2025 API
View.ConvertToIndependent Method
 Convert the dependent view to independent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void ConvertToIndependent()
Public Sub ConvertToIndependent
public:
void ConvertToIndependent()
member ConvertToIndependent : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This view is not dependent.
Remarks
 This method can be only applied to a dependent view. A dependent view can be created from another view using method View.Duplicate(ViewDuplicateOption.AsDependent). Dependent views have a valid primary view element ID that can be obtained via method View.GetPrimaryViewId(); Independent views have InvalidElementId as their primary view ID.
Example
public void MakeViewIndependent(View view)
{
    // Independent views will have an InvalidElementId for the Primary View Id
    if (view.GetPrimaryViewId() != ElementId.InvalidElementId)
    {
        view.ConvertToIndependent();
    }
}
Public Sub MakeViewIndependent(view As View)
    ' Independent views will have an InvalidElementId for the Primary View Id
    If view.GetPrimaryViewId() <> ElementId.InvalidElementId Then
        view.ConvertToIndependent()
    End If
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace